/*
Задача 1

Напишите функцию, которая возвращает самый большой элемент в списке.

// ---------------------------------------------------------

Задача 2

Напишите функцию, которая переворачивает список, предпочтительно на месте

// ---------------------------------------------------------

Задача 3

Напишите функцию, которая проверяет, встречается ли элемент в списке. 

// ----------------------------------------------------------

Задача 8

Найдите функцию onAll, которая применяет функцию к каждому элементу списка. 

Используйте его для печати первых двадцати полных квадратов. Полные квадраты можно найти, умножив каждое натуральное число само на себя. Первые несколько полных квадратов - это 1**1 = 1,   2**2 = 4, 3**3 = 9, 4**4 = 16.

Двенадцать, например, не является полным квадратом, потому что не существует натурального числа m, такого чтобы m * m = 12.

*/


